#ひらがな配列
hiragana = [["あ", "い", "う", "え", "お"],
            ["か", "き", "く", "け", "こ"],
            ["さ", "し", "す", "せ", "そ"],
            ["た", "ち", "つ", "て", "と"],
            ["な", "に", "ぬ", "ね", "の"],
            ["は", "ひ", "ふ", "へ", "ほ"],
            ["ま", "み", "む", "め", "も"],
            ["や", "ゆ", "よ", "濁点", "　"],
            ["ら", "り", "る", "れ", "ろ"],
            ["わ", "を", "ん", "DELETE", "ENTER"],]

dakuten = [["ぁ", "ぃ", "ぅ", "ぇ", "ぉ"],
           ["が", "ぎ", "ぐ", "げ", "ご"],
           ["ざ", "じ", "ず", "ぜ", "ぞ"],
           ["だ", "ぢ", "づ", "で", "ど"],
           ["", "", "っ", "", ""],
           ["ば", "び", "ぶ", "べ", "ぼ"],
           ["ぱ", "ぴ", "ぷ", "ぺ", "ぽ"],
           ["ゃ", "ゅ", "ょ", "濁点", "　"],
           ["ー", "", "", "", ""],
           ["", "", "", "DELETE", "ENTER"],]

alphabet_small = [["9", "i", "r", "-", ""],
                  ["8", "h", "q", "z", ""],
                  ["7", "g", "p", "y", ""],
                  ["6", "f", "o", "x", ""],
                  ["5", "e", "n", "w", ""],
                  ["4", "d", "m", "v", ""],
                  ["3", "c", "l", "u", ""],
                  ["2", "b", "k", "t", ""],
                  ["1", "a", "j", "s", ""],
                  ["0", " ", "大文字", "DELETE", "ENTER"],]

alphabet_big = [["9", "I", "R", "-", ""],
                ["8", "H", "Q", "Z", ""],
                ["7", "G", "P", "Y", ""],
                ["6", "F", "O", "X", ""],
                ["5", "E", "N", "W", ""],
                ["4", "D", "M", "V", ""],
                ["3", "C", "L", "U", ""],
                ["2", "B", "K", "T", ""],
                ["1", "A", "J", "S", ""],
                ["0", " ", "大文字", "DELETE", "ENTER"],]

number = [["9", "up", "", "", ""],
          ["8", "down", "", "", ""],
          ["7", "", "", "", ""],
          ["6", "", "", "", ""],
          ["5", "", "", "", ""],
          ["4", "", "", "", ""],
          ["3", "", "", "", ""],
          ["2", "", "", "", ""],
          ["1", "", "", "", ""],
          ["0", "", "", "DELETE", "ENTER"],]

#カーソル操作定数
#[検索_x, 検索_y, パー/グーの操作_x, パー/グーの操作_y, 右向きの操作_x, 右向きの操作_y, 左向きの操作_x, 左向きの操作_y]

musicconst = []
with open('musicconst.txt') as f:
    for line in f:
        musicconst.append(int(line))

movieconst = []
with open('movieconst.txt') as f:
    for line in f:
        movieconst.append(int(line))

searchconst = []
with open('searchconst.txt') as f:
    for line in f:
        searchconst.append(int(line))
